
# Sales Data Analysis with Pandas & NumPy

## Project Description

در این پروژه، یک دیتاست فروش ساده را با استفاده از Python، Pandas تحلیل می‌کنیم.

**هدف‌ها:**
- تمرین کار با فایل CSV
- تحلیل داده با Pandas
- نتیجه‌گیری و ارائه گزارش ساده

## Required Libraries

- pandas

In [10]:
import pandas as pd

## Step 1: Load the Dataset

In [2]:
df = pd.read_csv('sales.csv')
df.head()

         date   product     city  price  quantity
0  2025-01-01    Laptop   Tehran   1200         1
1  2025-01-02    Laptop   Shiraz   1200         2
2  2025-01-03     Mouse   Tehran     25         5
3  2025-01-04  Keyboard   Tabriz     45         3
4  2025-01-05     Mouse  Isfahan     25         4

## Step 2: Basic Info

In [3]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      10 non-null     object
 1   product   10 non-null     object
 2   city      10 non-null     object
 3   price     10 non-null     int64
 4   quantity  10 non-null     int64
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

             price  quantity
count    10.000000  10.00000
mean    501.000000   2.80000
std     601.658818   1.75119
min      25.000000   1.00000
25%      30.000000   1.25000
50%      45.000000   2.50000
75%    1200.000000   3.75000
max    1200.000000   6.00000

In [4]:
df.describe().transpose()

          count   mean         std   min    25%   50%      75%     max
price      10.0  501.0  601.658818  25.0  30.00  45.0  1200.00  1200.0
quantity   10.0    2.8    1.751190   1.0   1.25   2.5     3.75     6.0

## Step 3: Total Sales Calculation

In [5]:
df['total_sales']=df['price'] * df['quantity']
df

         date   product     city  price  quantity  total_sales
0  2025-01-01    Laptop   Tehran   1200         1         1200
1  2025-01-02    Laptop   Shiraz   1200         2         2400
2  2025-01-03     Mouse   Tehran     25         5          125
3  2025-01-04  Keyboard   Tabriz     45         3          135
4  2025-01-05     Mouse  Isfahan     25         4          100
5  2025-01-06    Laptop   Tehran   1200         1         1200
6  2025-01-07  Keyboard   Shiraz     45         2           90
7  2025-01-08     Mouse  Isfahan     25         6          150
8  2025-01-09    Laptop   Tabriz   1200         1         1200
9  2025-01-10  Keyboard   Tehran     45         3          135

In [6]:
# پیدا کردن ایندکس سطر با بیشترین total_sales
max_index = df["total_sales"].argmax()

# نمایش سطر کامل
df.loc[max_index]

date           2025-01-02
product            Laptop
city               Shiraz
price                1200
quantity                2
total_sales          2400
Name: 1, dtype: object

In [7]:
# مرتب کردن دیتافریم بر اساس total_sales نزولی
df_sorted = df.sort_values(by="total_sales", ascending=False)

# نمایش اولین سطر (بیشترین)
df_sorted.head(1)

         date product    city  price  quantity  total_sales
1  2025-01-02  Laptop  Shiraz   1200         2         2400

In [8]:
df_sorted

         date   product     city  price  quantity  total_sales
1  2025-01-02    Laptop   Shiraz   1200         2         2400
0  2025-01-01    Laptop   Tehran   1200         1         1200
5  2025-01-06    Laptop   Tehran   1200         1         1200
8  2025-01-09    Laptop   Tabriz   1200         1         1200
7  2025-01-08     Mouse  Isfahan     25         6          150
3  2025-01-04  Keyboard   Tabriz     45         3          135
9  2025-01-10  Keyboard   Tehran     45         3          135
2  2025-01-03     Mouse   Tehran     25         5          125
4  2025-01-05     Mouse  Isfahan     25         4          100
6  2025-01-07  Keyboard   Shiraz     45         2           90

In [9]:
# گروه‌بندی بر اساس شهر و جمع تعداد فروش
city_sales = df.groupby("city")["quantity"].sum().sort_values(ascending=False)
print("\nجمع تعداد فروش هر شهر:")
city_sales

جمع تعداد فروش هر شهر:

city
Isfahan    10
Tehran     10
Shiraz      4
Tabriz      4
Name: quantity, dtype: int64

<p align='center'>by Nariman Nadimi</p>